In [3]:
import pandas as pd
import numpy as np

In [5]:
s = pd.Series() # 1차원 데이터 - key : value (dict)
print(s)
data = pd.Series([1,2,3,4])
print(data)
data2 = pd.Series(['a','b','c','d'])
print(data2)
data3 = pd.Series(['a','b','c','d'],index = [100,110,120,130])
print(data3)

Series([], dtype: float64)
0    1
1    2
2    3
3    4
dtype: int64
0    a
1    b
2    c
3    d
dtype: object
100    a
110    b
120    c
130    d
dtype: object

In [8]:
a = np.array([1,2,3,4])
print(a)
data4 = pd.Series(a, index = [10,20,30,40])
print(data4)

[1 2 3 4]
10    1
20    2
30    3
40    4
dtype: int32
1     test
2    test2
3    test3
dtype: object

In [14]:
dict1 = {1:'test',2:'test2',3:'test3'} # dict key > index
data5 = pd.Series(dict1)
print(data5)
ct1 = {1:'test',2:'test2',3:'test3'} # dict key > index
data5 = pd.Series(dict1)
print(data5)
data6 = pd.Series(dict1, index=[3,1,2]) # value는 인덱스를 따라간다
print(data6, type(data6))
data7 = pd.Series(dict1, index=[3,1,4]) # 데이터 밸류가 없는 인덱스 : NaN
print(data7, type(data7))

1     test
2    test2
3    test3
dtype: object
1     test
2    test2
3    test3
dtype: object
3    test3
1     test
2    test2
dtype: object <class 'pandas.core.series.Series'>
3    test3
1     test
4      NaN
dtype: object <class 'pandas.core.series.Series'>

In [23]:
data7 = pd.Series(5, index=[1,2,3,4,5,6])
print(data7)
data8 = pd.Series([1,2,3,4,5,6])
print(data8)
print(data8[0]) # 첫번째 요소에 접근
print(data8[:3]) # 슬라이싱도 가능하다!
data9 = pd.Series([1,2,3,4,5,6], index=['a','b','c','d','e','f'])
print(data9['a'])

1    5
2    5
3    5
4    5
5    5
6    5
dtype: int64
0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
1
0    1
1    2
2    3
dtype: int64
1

In [25]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [26]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [27]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [29]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [30]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [32]:
print(obj2['a'])
obj2['d']=6
obj2[['c','a','d']]

-5

c    3
a   -5
d    6
dtype: int64

In [37]:
obj2[obj2>0]
print(obj2*2)
print(np.exp)
print('b' in obj2)
print('e' in obj2)

d    12
b    14
a   -10
c     6
dtype: int64
<ufunc 'exp'>
True
False

## 5.1.2. Data Frame

In [40]:
data = {'state' : ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year' : [2000,2001,2002,2001,2002,2003],
        'pop' : [1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)

In [41]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [42]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [43]:
pd.DataFrame(data, columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [44]:
frame2 = pd.DataFrame(data, columns=['year','state','pop','debt'],
                            index = ['one','two','three','four','five','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [45]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [46]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [47]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [48]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [56]:
# list, Dict, Series, Numpy Arrays, DataFrame
df = pd.DataFrame()
type(df)
df1 = pd.DataFrame([1,2,3,4,5,6])
sr1 = pd.Series([1,2,3,4,5,6])
print(df1) # column
print(sr1)
df3 = pd.DataFrame([['test1',10],['test2',20],['test3',30]], columns = ['name','age'], dtype = float)
print(df3)
df4 = pd.DataFrame({'name':['이순신','강감찬','을지문덕','홍길동'],\
                    'age':[20,21,22,30]}, index = ['n1','n2','n3','n4'],\
                    columns = ['age','name'])
print(df4)
df5 = pd.DataFrame([{'n1':10,'n2':20},{'n1':100,'n2':200,'n3':300}])
print(df5)

0
0  1
1  2
2  3
3  4
4  5
5  6
0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
    name   age
0  test1  10.0
1  test2  20.0
2  test3  30.0
    age  name
n1   20   이순신
n2   21   강감찬
n3   22  을지문덕
n4   30   홍길동
    n1   n2     n3
0   10   20    NaN
1  100  200  300.0

In [76]:
#두개의 시리즈를 딕셔너리에 넣어 데이터프레임 만들기
col1 = pd.Series([1,2,3])
col2 = pd.Series([3,4,5])
df6 = pd.DataFrame({'One': col1, 'Two': col2})
df6['three'] = pd.Series([5,6,6]) # column 추가
df6

   One  Two  three
0    1    3      5
1    2    4      6
2    3    5      6

In [77]:
df6['One'] # Series 출력

0    1
1    2
2    3
Name: One, dtype: int64

In [78]:
df6['four'] = df6['One']+df6['Two'] # 계산결과식 열 추가
df6

   One  Two  three  four
0    1    3      5     4
1    2    4      6     6
2    3    5      6     8

In [79]:
# 열 삭제
del df6['four']
df6

   One  Two  three
0    1    3      5
1    2    4      6
2    3    5      6

In [83]:
data=[[1,2],[3,4]]
df = pd.DataFrame(data,index=['r1','r2'],columns = ['c1','c2'])
df
print(df['c2'])
d = df.loc['r1'] #column이름
d2 = df.iloc[0] #내부 열번호
print(d)
print(d2)

r1    2
r2    4
Name: c2, dtype: int64
c1    1
c2    2
Name: r1, dtype: int64
c1    1
c2    2
Name: r1, dtype: int64

In [85]:
print(df[:1])
print(df.iloc[1])

c1  c2
r1   1   2
c1    3
c2    4
Name: r2, dtype: int64

In [88]:
data2 = {'a':[1,2,3,4,5], 'b':[6,7,8,9,10]}
df2 = pd.DataFrame(data2, index=['r1','r2','r3','r4','r5'])
print(df2.iloc[1])
print(df2['a'])
print(df2['b'])
print(df2.loc['r1'])
row = pd.DataFrame({'c':[1,2,3,4,5]})
df2.append(row)
print(df2)

a    2
b    7
Name: r2, dtype: int64
r1    1
r2    2
r3    3
r4    4
r5    5
Name: a, dtype: int64
r1     6
r2     7
r3     8
r4     9
r5    10
Name: b, dtype: int64
a    1
b    6
Name: r1, dtype: int64
    a   b
r1  1   6
r2  2   7
r3  3   8
r4  4   9
r5  5  10

In [91]:
df2.drop('r1') # 행삭제

    a   b
r2  2   7
r3  3   8
r4  4   9
r5  5  10

In [92]:
df2.index

Index(['r1', 'r2', 'r3', 'r4', 'r5'], dtype='object')

## 5.1.3. 색인객체

In [97]:
obj = pd.Series(range(3), index=['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [98]:
index[1:]

Index(['b', 'c'], dtype='object')

In [100]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [103]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [105]:
dup_labels = pd.Index(['foo','foo','bar','bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [106]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [108]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [113]:
obj3 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
obj3
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [115]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index=['a','c','d'],
                    columns=['Ohio','Texas','California'])
frame

frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [4]:
data2 = {'a':pd.Series([1,2,3]), 'b':pd.Series([2,3,4])}
df2 = pd.DataFrame(data2)
print(df2)
print(df2.shape)
print(df2.dtypes)

a  b
0  1  2
1  2  3
2  3  4
(3, 2)
a    int64
b    int64
dtype: object